tutorials/multiphase/interPorousFoam/porousDamBreak/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

blockage
{
    type            multiphasePorositySource;
    active          yes;

    porosity        porosity;

    regions
    {
        region1
        {
            cellZone        c0;
            a               0;
            b               2;
            c               0.34;
            porosity        0.49;
            D50             0.0159;
        }
    }
}


// ************************************************************************* //
